Revit 2024 API
ParameterTypeId.RebarBarStyle Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarBarStyle { get; }
Visual Basic
Public Shared ReadOnly Property RebarBarStyle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarBarStyle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace